DataProcessors/СообщенияМОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СообщенияМОС</Name>
			<Comment>Работа с сообщениями механизма обмена сообщениями</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеРолиПользователя</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаНазначениеРолей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМагазина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщенийМОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказаниеТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСотрудника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнцидента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИнцидентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщенийМОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтИмени</Name>
					<Comment>Код подразделения, от имени которого отправляется сообщение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАдминистратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСообщенийМОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочитал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяПрочтения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяВыполненияПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяВыполненияФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПодразделения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействительноДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Comment>Возм. значения: вход.; исход.; внутр.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД_rec</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНаправления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКодаНаправления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрочтеноВсеми</Name>
							<Comment>Имеет смысл для TypeAddr = 1 или 3</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИнцидента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыИнцидентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРодителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИнцидента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринялКИсполнению</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодПодразделенияПолучателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПолучатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтаршийСмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочитал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяПрочтения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыСообщенийМОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСообщенийМОС</Name>
			<Comment>Типы сообщений механизма обмена сообщениями (МОС)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнформационноеСообщение</Name>
					<Comment>Служит для передачи информации в магазин из центрального офиса</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инцидент</Name>
					<Comment>Служит для передачи информации о возникшем отклонении, которое необходимо устранить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Служит для постановки задачи исполнителям</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СообщенияМОС/Forms/ФормаПереадресации/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Отказ = Ложь;
	ЗаполнитьТекстСообщения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОтправитьСообщениеНаСервере();
		ЗакрытиеПослеОтправки = Истина;
		ОповеститьОЗаписиНового(Неопределено);
		Закрыть();
	Исключение
		Предупреждение("Не удалось отправить сообщение");
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщения(Отказ)

	ТекДата = Обработки.СообщенияМОС.ПолучитьРабочуюДатуМОС();
	НовыйТекстСообщения = ПолучитьМодифицированныйТекстСообщения(ТекДата);
	Если СтрДлина(НовыйТекстСообщения) > 1000 Тогда
		Сообщить("Превышена максимальная длина текстового сообщения! Переадресация невозможна");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.ТекстСообщения = НовыйТекстСообщения;

КонецПроцедуры


&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	ДанныеДляMessage = Новый Структура;
	МассивДанныхДляMessages = Новый Массив;
	МассивДанныхДляRecipietns = Неопределено;
	
	ДанныеДляMessage.Вставить("TTL", СрокАктуальности);
	ДанныеДляMessage.Вставить("Role", ?(ЗначениеЗаполнено(РольПолучателя.Код), Число(РольПолучателя.Код), ""));
	ДанныеДляMessage.Вставить("Direction", 2);
	ДанныеДляMessage.Вставить("ShopNo", Магазин);
	ДанныеДляMessage.Вставить("ShopNo_rep", Магазин);
	ДанныеДляMessage.Вставить("MessageText", Объект.ТекстСообщения);
	ДанныеДляMessage.Вставить("MessageType", 2);
	ДанныеДляMessage.Вставить("Author", Число(Объект.КодСотрудника));
	ДанныеДляMessage.Вставить("AddDateTime", ТекДата);
	ДанныеДляMessage.Вставить("RoleSender", Объект.РольПользователя.Код);
	ДанныеДляMessage.Вставить("Subject", Объект.Тема);
	ДанныеДляMessage.Вставить("IDMes", ИДРод);
	ДанныеДляMessage.Вставить("TypeAddr", 3);
	ДанныеДляMessage.Вставить("Direction", 2);
	ДанныеДляMessage.Вставить("Status", 1);
	
	МассивДанныхДляMessages.Добавить(ОбщегоНазначения.СкопироватьУниверсальнуюКоллекцию(ДанныеДляMessage));
	
	ДанныеДляЗаписи = Новый Структура("Messages, Recipients", МассивДанныхДляMessages, МассивДанныхДляRecipietns);
	ИДСообщения = 0;
	Обработки.СообщенияМОС.ДобавитьЗаписиВТаблицыSQL(ДанныеДляЗаписи, ИДСообщения);
	
	СоединениеСБДSQL = МеханизмОбменаСообщениямиПовтИсп.ПолучитьСоединениеСБДSQL("SMS_REPL");
	ТекстКомандыSQL = "UPDATE SMS_REPL.dbo.info_exch_messages SET Status = 5 WHERE id = CAST('" + ИДПереадресации + "' AS uniqueidentifier)"; 
	СоединениеСБДSQL.Execute(ТекстКомандыSQL);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.РеквизитОбъект, Объект);
	
	СрокАктуальности = Обработки.СообщенияМОС.ПолучитьЗначениеTTL();
	СО1 = Новый Структура;
	СО1.Вставить("Идентификатор", Параметры.ИД);
	МСС = Объект.Сообщения.НайтиСтроки(СО1);
	Если МСС.Количество() = 0 Тогда
		Сообщить("Не найдена строка сообщения");
		Отказ = Истина;
		Возврат;
	Иначе
		ТекДанные = МСС[0];
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекДанные);
	ИДРод = Параметры.ИДРод;
	ИДПереадресации = ТекДанные.Идентификатор;
	
	Объект.РольПользователя = ТекДанные.РольПолучателя;
	Объект.Тема = ТекДанные.Тема;
	Объект.ТипСообщения = Перечисления.ТипыСообщенийМОС.Инцидент;
	ТекстИсходногоСообщения = Параметры.ТекстСообщения;
	Магазин = ТекДанные.КодПодразделения;
	
	Заголовок = Заголовок + Обработки.СообщенияМОС.ПолучитьДобавкуКЗаголовкуОкна();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗакрытиеПослеОтправки Тогда
		Ответ1 = Вопрос("При закрытии введённые данные будут утеряны! Вы действительно хотите закрыть данное окно?", РежимДиалогаВопрос.ДаНет);
		Если Ответ1 = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьМодифицированныйТекстСообщения(Дата1)
	
	НовыйТекст = "Переадресация: " + Строка(Дата1) + ", от " + Строка(Объект.РольПользователя) + " ("
			+ Строка(Объект.Пользователь) + ") к " + Строка(РольПолучателя) + ".";
	Если ЗначениеЗаполнено(Комментарий) Тогда
		НовыйТекст = НовыйТекст + Символы.ПС + "Комментарий: " + СокрЛП(Комментарий);
	КонецЕсли;
	НовыйТекст = НовыйТекст + Символы.ПС + СокрЛП(ТекстИсходногоСообщения);
	Возврат НовыйТекст;

КонецФункции // ()
